## Intermediate Data Science

#### University of Redlands - DATA 201
#### Prof: Joanna Bieri [joanna_bieri@redlands.edu](mailto:joanna_bieri@redlands.edu)
#### [Class Website: data201.joannabieri.com](https://joannabieri.com/data201_intermediate.html)

In [1]:
# Some basic package imports
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import plotly.express as px
from plotly.subplots import make_subplots
import plotly.io as pio
pio.renderers.defaule = 'colab'

### You Try - 3 Warm-Up Problems From Lecture

Run the data cell to see the data then answer the questions.

Each problem is separated by a line.

------------------------------------------------------

In [2]:
#DATA
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
example_series = pd.Series(sdata)
example_series

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

### You Try:

Using series methods and python code:

1. Get a list of the states that are the index.
2. Check if Idaho is in the index.
3. Get just the states with numbers less then 20,000.
4. Run the provided code and explain the results. Why do we end up with NaN and what does NaN mean?

In [3]:
example_series.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [4]:
'Idaho' in example_series

False

In [5]:
example_series[example_series<20000]

Oregon    16000
Utah       5000
dtype: int64

In [6]:
# Explain the results 4
states = ["California", "Ohio", "Oregon", "Texas"]
new_series = pd.Series(sdata, index=states)
new_series

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

The second line on code creates a series named 'new_series' that contains the data from 'sdata' and the indexes are from 'states'. Since "California" is not included in 'sdata', it returns a NaN in 'new_series'.

---------------------------------------

In [7]:
# DATA
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### You Try

1. How does the following command work?
2. See if you can add a column that check if the year is greater than 2001.

In [8]:
# How does this work 1
df['eastern'] = df['state'] == 'Ohio'
df

    state  year  pop  eastern
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

The code creates a new column named 'eastern' that contains a boolean of if the corresponding content of the 'state' column is 'Ohio'.

In [9]:
df['recent'] = df['year']>2001
df

    state  year  pop  eastern  recent
0    Ohio  2000  1.5     True   False
1    Ohio  2001  1.7     True   False
2    Ohio  2002  3.6     True    True
3  Nevada  2001  2.4    False   False
4  Nevada  2002  2.9    False    True
5  Nevada  2003  3.2    False    True

------------------------------------------------

In [10]:
# DATA
df = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

### You Try
1. Get rows a and d for just Ohio and Texas.

In [11]:
df.loc['a',['Ohio','Texas']]

Ohio     0
Texas    1
Name: a, dtype: int64

In [12]:
df.loc['d',['Ohio','Texas']]

Ohio     6
Texas    7
Name: d, dtype: int64

In [13]:
df.drop(index='c', inplace=True)
df.drop(columns='California', inplace=True)
df

   Ohio  Texas
a     0      1
d     6      7

----------------------------------------

## Market Data from Lecture

In [14]:
# Lets read in some data and look at some statistics
price = pd.read_pickle("data/yahoo_price.pkl")
volume = pd.read_pickle("data/yahoo_volume.pkl")

In [15]:
returns = price.pct_change()
returns.head()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [16]:
returns.describe()

              AAPL         GOOG          IBM         MSFT
count  1713.000000  1713.000000  1713.000000  1713.000000
mean      0.000972     0.000671     0.000236     0.000595
std       0.016641     0.015830     0.012102     0.014667
min      -0.123558    -0.083775    -0.082790    -0.113995
25%      -0.007516    -0.006904    -0.006049    -0.007376
50%       0.000886     0.000270     0.000234     0.000312
75%       0.010422     0.008462     0.006806     0.008162
max       0.088741     0.160524     0.056652     0.104522

In [17]:
# correlation coefficient
returns['AAPL'].corr(returns['IBM'])

np.float64(0.3868174361139097)

In [18]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [19]:
# covariance matrix
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

--------------------------

## Pandas Analysis - Day2 HW

In [34]:
#!conda install -c conda-forge kagglehub -y

In [26]:
#!conda install kagglehub

In [25]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("yasserh/titanic-dataset")

print("Path to dataset files:", path)

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.8), please consider upgrading to the latest version (0.3.13).
Downloading from https://www.kaggle.com/api/v1/datasets/download/yasserh/titanic-dataset?dataset_version_number=1...

100%|██████████| 22.0k/22.0k [00:00<00:00, 1.07MB/s]

Extracting files...
Path to dataset files: C:\Users\josee\.cache\kagglehub\datasets\yasserh\titanic-dataset\versions\1

In [33]:
# Copy the path to the data set
# For me this was:
file = '/home/bellajagu/.cache/kagglehub/datasets/yasserh/titanic-dataset/versions/1/Titanic-Dataset.csv'
# Yours will be different!

df = pd. read_csv(file)
df

FileNotFoundError: [Errno 2] No such file or directory: '/home/bellajagu/.cache/kagglehub/datasets/yasserh/titanic-dataset/versions/1/Titanic-Dataset.csv'

**Your goal is to do a quick analysis of the Titanic data! You can answer any questions that you find interesting but here are some things to start with:**

1. How many variables and observations? Which are Numerical/Categorical?
2. Do any of the columns have NaNs in them? What do NaNs mean?
3. How many passengers survived?
4. Is survival correlated with Fare?
5. How many passengers were alone vs. traveling with family?
6. Were people traveling alone more or less likely to survive?
7. Do the basic statistics change if you group by class?

and so on... see if you can come up with some questions of your own! Curiosity is a big part of data science!

How far can you get in just an hour or two?


---------------------------------

**Variable Notes**
- PassengerId:   Unique ID of the passenger
- Survived:   Survived (1) or died (0)
- Pclass:   Passenger’s class (1st, 2nd, or 3rd)
- Name:   Passenger’s name
- Sex:   Passenger’s sex
- Age:   Passenger’s age
- SibSp:   Number of siblings/spouses aboard the Titanic
- Parch:   Number of parents/children aboard the Titanic
- Ticket:   Ticket number
- Fare:   Fare paid for ticket
- Cabin:   Cabin number
- Embarked:   Where the passenger got on the ship (C — Cherbourg, S — Southampton, Q = Queenstown)

------------------------------------

Your final notebook should:

- [ ] Be a completely new notebook with just the Titanic stuff in it: HW2-Titanic.ipynb
- [ ] Be reproducible with junk code removed.
- [ ] Have lots of language describing what you are doing, especially for questions you are asking or things that you find interesting about the data. Use complete sentences, nice headings, and good markdown formatting: https://www.markdownguide.org/cheat-sheet/
- [ ] It should run without errors from start to finish.